{
  "backend/main.mo": "Defines the chat backend actor with channel, message, attachment, user profile types, persistent state, authorization mixins, storage mixins, and XP/level calculation helpers.",
  "feature_evidence.json": "Lists implemented features with associated files, components, and test IDs for PWA, offline mode, notifications, and offline messaging.",
  "frontend-file-summaries.txt": "Provides short descriptions of major frontend files, including components, hooks, utilities, and styles.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables, dark mode variants, and base element styling.",
  "frontend/index.html": "HTML entry file configuring PWA metadata, icons, manifest link, and mounting the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, start URL, display mode, shortcuts, and categories.",
  "frontend/public/service-worker.js": "Service worker implementing precaching, runtime caching, offline fallbacks, and network/caching strategies for assets and navigation.",
  "frontend/src/App.tsx": "Main app component registering the service worker, handling identity and backend initialization, showing profile setup, and rendering the chat layout.",
  "frontend/src/components/ChannelSettingsDialog.tsx": "Provides a dialog for configuring channel settings, including random join toggling and setting or removing a max member limit. Uses hooks to fetch and update channel details.",
  "frontend/src/components/ChatArea.tsx": "Renders messages for the active channel, handles loading states, notifications, scrolling, and access checks. Integrates message fetching, user state, and channel admin tools.",
  "frontend/src/components/ChatLayout.tsx": "Defines the main chat layout with header, sidebar, chat area, and message input. Manages channel selection, sidebar visibility, and online status handling.",
  "frontend/src/components/CommandEducationCenter.tsx": "Displays rotating command instructions and app statistics when no channel is selected. Provides animated transitions and a help interface for new users.",
  "frontend/src/components/Header.tsx": "Renders the top navigation bar with theme toggle, authentication controls, notifications, and user info. Displays app title and user level progress when available.",
  "frontend/src/components/LeaveChannelDialog.tsx": "Shows a confirmation dialog for leaving a channel, with delete options for admins. Calls back with the chosen leave action.",
  "frontend/src/components/LevelProgressBar.tsx": "Fetches and animates the user’s level progress bar. Displays current level and a smooth progress indicator.",
  "frontend/src/components/LiveRecordingWaveform.tsx": "Canvas-based animated audio waveform that updates bar heights from live audio levels and handles resizing.",
  "frontend/src/components/MediaLibraryDialog.tsx": "Dialog for selecting and uploading images, GIFs, and documents with validation and progress tracking.",
  "frontend/src/components/MessageBubble.tsx": "Displays chat messages with media attachments, linkified text, avatars, timestamps, and download support.",
  "frontend/src/components/MessageInput.tsx": "Chat input supporting commands, channel actions, media attachments, and voice recording with animated placeholder text.",
  "frontend/src/components/OfflineBanner.tsx": "Simple banner warning the user when offline.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with username input and submission handling.",
  "frontend/src/components/RotatingAppStatistics.tsx": "Cycles through global app statistics with timed fade transitions.",
  "frontend/src/components/Sidebar.tsx": "Displays channel lists with loading, error, and empty states and allows selecting channels based on actor and query status.",
  "frontend/src/components/VoiceMessagePlayer.tsx": "Audio player component that loads an audio URL, handles play/pause, tracks progress, and displays a waveform bar and timestamp.",
  "frontend/src/components/VoiceRecorderPanel.tsx": "UI panel for recording and previewing voice messages with discard, stop, play/pause, and send controls.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useActorExtended.ts": "Enhanced actor hook providing retry, error state, readiness flags, and optional admin initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, loading stored identities, login/logout flow, and exposing identity status through context.",
  "frontend/src/hooks/useNotifications.ts": "Manages browser notification permission, enabling/disabling notifications, and showing notifications when allowed.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using window event listeners.",
  "frontend/src/hooks/useQueries.ts": "Provides multiple React Query hooks for fetching and mutating user data, channels, and app stats using an actor API with online checks and retry logic.",
  "frontend/src/hooks/useVoiceRecorder.ts": "Implements a voice recording hook using MediaRecorder and Web Audio API, offering recording controls, duration tracking, and audio level monitoring.",
  "frontend/src/index.css": "Defines global Tailwind CSS layers and theme variables for light and dark modes, including WhatsApp-style chat colors and layout rules.",
  "frontend/src/lib/linkify.ts": "Parses text for URLs and splits it into text and link segments using a regex-based utility.",
  "frontend/src/main.tsx": "Initializes React app by mounting root, setting up React Query, and wrapping the app with Internet Identity provider.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login page with branding, feature highlights, and a button to authenticate via Internet Identity.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters and session-stored values, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom OKLCH color tokens, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing the app’s current feature set and versions, including authentication, actor handling, roles, profiles, XP/leveling, and global statistics."
}